       IDENTIFICATION DIVISION.
       PROGRAM-ID. TESTECOB.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 WS-NOMBRE   PIC X(10).
       PROCEDURE DIVISION.
           DISPLAY "DIGITE SU NOMBRE: "
           ACCEPT WS-NOMBRE
           DISPLAY "EL NOMBRE DIGITADO ES: " WS-NOMBRE
           STOP RUN.
           


